       IDENTIFICATION DIVISION.
       PROGRAM-ID. DATATYPES.
       AUTHOR. BRUNO PACHECO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-GROUP.
           05 WS-NUMERIC           PIC 9(2) VALUE 45.
           05 WS-SIGNED-DECIMAL    PIC S9(3)V9(2) VALUE -123.49.
           05 WS-UNSIGNED-DECIMAL  PIC 9(3)V9(2) VALUE 123.45.
           05 WS-ALPHABETIC        PIC A(6) VALUE 'ABCDEF'.
           05 WS-ALPHANUMERIC      PIC X(5) VALUE 'A121$'.
           05 WS-NUMERIC-EDITED    PIC $$$,$$9.99 VALUE 201.11.
           05 WS-INTEGER-EDITED    PIC ZZZZZZZZZ9 VALUE 100.
           05 WS-SUBGROUP.
              10 WS-REPEATED-F     PIC X(20) VALUE IS ALL 'F'.
              10 WS-REPEATED-J     PIC X(20) VALUE IS ALL 'J'.
              10 WS-REPEATED-O     PIC X(20) VALUE IS ALL 'O'.

       PROCEDURE DIVISION.
           DISPLAY WS-NUMERIC.
           DISPLAY WS-SIGNED-DECIMAL.
           DISPLAY WS-UNSIGNED-DECIMAL.
           DISPLAY WS-ALPHABETIC.
           DISPLAY WS-ALPHANUMERIC.
           DISPLAY WS-NUMERIC-EDITED.
           DISPLAY WS-INTEGER-EDITED.
           DISPLAY WS-SUBGROUP.
           DISPLAY WS-REPEATED-F.
           DISPLAY WS-REPEATED-J.
           DISPLAY WS-REPEATED-O.
           STOP RUN.

       END PROGRAM DATATYPES.